Tekla Open API Reference for Tekla Structures 2025
RebarSpacing.NumberOfBars Property
 Gets or sets the number of bars in the spacing object.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public int NumberOfBars { get; set; }
Public Property NumberOfBars As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
RebarSpacing Class
Tekla.Structures.Model Namespace